import numpy as np
class 平衡气缸配管口径计算():
    def __init__(self,活塞直径=500,气缸数量=2,配管口径=150,最大速度=740,接口数量=4):
        self.活塞直径=活塞直径
        self.气缸数量=气缸数量
        self.配管口径=配管口径
        self.最大速度=最大速度#mm/s
        self.接口数量=接口数量
    def 计算(self):
        self.活塞面积=np.pi*self.活塞直径**2/4*self.气缸数量
        self.配管面积=np.pi*self.配管口径**2/4*self.接口数量
        self.空气流速=self.活塞面积*self.最大速度/self.配管面积/1000#小于30
        print(self.空气流速)
        return
class 平衡气缸配管口径计算方法二():
    def __init__(self,活塞直径=500,行程=2,配管口径=150,滑块行程次数=740):
        self.活塞直径=活塞直径#cm
        self.行程=行程#cm
        self.配管口径=配管口径
        self.滑块行程次数=滑块行程次数
    def 计算(self):
        self.空气流速=self.滑块行程次数*self.活塞直径**2*self.行程/(30000*self.配管口径**2)#20-25m/s
        print(self.空气流速)
        return
if __name__=="__main__":
    测试=平衡气缸配管口径计算(活塞直径=425,气缸数量=2,配管口径=40,最大速度=1000,接口数量=4)
    测试2=平衡气缸配管口径计算方法二(活塞直径=42.5,行程=35,配管口径=80,滑块行程次数=50)
    测试.计算()
    测试2.计算()