# -*- coding = utf-8 -*-
# @time:2023/6/26 11:17
# Author:lizhuang
# @File:润滑计算浓油.py
# @Software:PyCharm
import numpy as np
class test():
    def __init__(self):
        print('Python')
if __name__ == '__main__': 
  test=test()


  def 多项式(a, b, c, d, x):
      y = a * x ** 3 + b * x ** 2 + c * x + d
      return y
  开式轴承直径 = np.linspace(0, 1000, 1000)
  半开式轴承直径 = np.linspace(0, 2000, 1000)
  导轨长度 = np.linspace(0, 2000, 1000)
  开式摆动轴承油量 = 多项式(1.447e-7, -7.371e-5, 0.1357, -0.583, 开式轴承直径)
  开式转动轴承油量 = 多项式(-7.077e-9, 8.159e-5, 0.06086, 0.2908, 开式轴承直径)
  半开式摆动轴承油量 = 多项式(1.812e-8, -1.844e-5, 0.067, -0.6297, 半开式轴承直径)
  半开式转动轴承油量 = 多项式(-8.865e-10, 2.042e-5, 0.03045, 0.2405, 半开式轴承直径)
  水平导轨油量 = 多项式(1.263e-8, -2.122e-5, 0.03749, -2.002, 导轨长度)
  垂直导轨油量 = 多项式(8.644e-12, 5.465e-9, 0.009588, 0.03063, 导轨长度)
  连杆轴承直径=572
  润滑点数=1
  spm=1200/60
  分配器次数=6.2
  润滑时间比例=0.2
  每转连杆轴承油量=多项式(1.447e-7, -7.371e-5, 0.1357, -0.583, 连杆轴承直径)
  print('该轴承每转需油量=',每转连杆轴承油量)
  #每点每次润滑油量=spm*每转连杆轴承油量/1000/(润滑点数*分配器次数*润滑时间比例)
  #print(每点每次润滑油量)
  每分钟油量1=spm*每转连杆轴承油量/1000/润滑时间比例/润滑点数
  #每分钟油量2=每点每次润滑油量*分配器次数
  每点每次润滑油量2 = 每分钟油量1 / 分配器次数
  #print(每分钟油量1,每分钟油量2)
  print('该点每分钟油量1=', 每分钟油量1)
  print('该点每次润滑油量2=', 每点每次润滑油量2)